{"modelTopology":{"class_name":"Model","config":{"name":"model1","layers":[{"name":"input1","class_name":"InputLayer","config":{"batch_input_shape":[null,256,256,3],"dtype":"float32","sparse":false,"name":"input1"},"inbound_nodes":[]},{"name":"conv2d_Conv2D1","class_name":"Conv2D","config":{"filters":16,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[5,5],"strides":[2,2],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D1","trainable":true},"inbound_nodes":[[["input1",0,0,{}]]]},{"name":"max_pooling2d_MaxPooling2D1","class_name":"MaxPooling2D","config":{"pool_size":[3,3],"padding":"same","strides":[2,2],"data_format":"channels_last","name":"max_pooling2d_MaxPooling2D1","trainable":true},"inbound_nodes":[[["conv2d_Conv2D1",0,0,{}]]]},{"name":"separable_conv2d_SeparableConv2D1","class_name":"SeparableConv2D","config":{"filters":16,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"separable_conv2d_SeparableConv2D1","trainable":true,"depthwise_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"pointwise_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"depthwise_regularizer":null,"pointwise_regularizer":null,"depthwise_constraint":null,"pointwise_constraint":null},"inbound_nodes":[[["max_pooling2d_MaxPooling2D1",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization1","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization1","trainable":true},"inbound_nodes":[[["separable_conv2d_SeparableConv2D1",0,0,{}]]]},{"name":"re_lu_ReLU1","class_name":"ReLU","config":{"max_value":null,"name":"re_lu_ReLU1","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization1",0,0,{}]]]},{"name":"separable_conv2d_SeparableConv2D2","class_name":"SeparableConv2D","config":{"filters":16,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"separable_conv2d_SeparableConv2D2","trainable":true,"depthwise_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"pointwise_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"depthwise_regularizer":null,"pointwise_regularizer":null,"depthwise_constraint":null,"pointwise_constraint":null},"inbound_nodes":[[["re_lu_ReLU1",0,0,{}]]]},{"name":"dropout_Dropout1","class_name":"Dropout","config":{"rate":0.3,"noise_shape":null,"seed":null,"name":"dropout_Dropout1","trainable":true},"inbound_nodes":[[["separable_conv2d_SeparableConv2D2",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization2","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization2","trainable":true},"inbound_nodes":[[["dropout_Dropout1",0,0,{}]]]},{"name":"re_lu_ReLU2","class_name":"ReLU","config":{"max_value":null,"name":"re_lu_ReLU2","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization2",0,0,{}]]]},{"name":"add_Add1","class_name":"Add","config":{"name":"add_Add1","trainable":true},"inbound_nodes":[[["max_pooling2d_MaxPooling2D1",0,0,{}],["re_lu_ReLU2",0,0,{}]]]},{"name":"separable_conv2d_SeparableConv2D3","class_name":"SeparableConv2D","config":{"filters":32,"kernel_size":[3,3],"strides":[2,2],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"separable_conv2d_SeparableConv2D3","trainable":true,"depthwise_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"pointwise_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"depthwise_regularizer":null,"pointwise_regularizer":null,"depthwise_constraint":null,"pointwise_constraint":null},"inbound_nodes":[[["add_Add1",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization3","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization3","trainable":true},"inbound_nodes":[[["separable_conv2d_SeparableConv2D3",0,0,{}]]]},{"name":"re_lu_ReLU3","class_name":"ReLU","config":{"max_value":null,"name":"re_lu_ReLU3","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization3",0,0,{}]]]},{"name":"separable_conv2d_SeparableConv2D4","class_name":"SeparableConv2D","config":{"filters":32,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"separable_conv2d_SeparableConv2D4","trainable":true,"depthwise_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"pointwise_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"depthwise_regularizer":null,"pointwise_regularizer":null,"depthwise_constraint":null,"pointwise_constraint":null},"inbound_nodes":[[["re_lu_ReLU3",0,0,{}]]]},{"name":"dropout_Dropout2","class_name":"Dropout","config":{"rate":0.3,"noise_shape":null,"seed":null,"name":"dropout_Dropout2","trainable":true},"inbound_nodes":[[["separable_conv2d_SeparableConv2D4",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization4","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization4","trainable":true},"inbound_nodes":[[["dropout_Dropout2",0,0,{}]]]},{"name":"conv2d_Conv2D2","class_name":"Conv2D","config":{"filters":32,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[1,1],"strides":[2,2],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D2","trainable":true},"inbound_nodes":[[["add_Add1",0,0,{}]]]},{"name":"re_lu_ReLU4","class_name":"ReLU","config":{"max_value":null,"name":"re_lu_ReLU4","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization4",0,0,{}]]]},{"name":"add_Add2","class_name":"Add","config":{"name":"add_Add2","trainable":true},"inbound_nodes":[[["conv2d_Conv2D2",0,0,{}],["re_lu_ReLU4",0,0,{}]]]},{"name":"separable_conv2d_SeparableConv2D5","class_name":"SeparableConv2D","config":{"filters":64,"kernel_size":[3,3],"strides":[2,2],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"separable_conv2d_SeparableConv2D5","trainable":true,"depthwise_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"pointwise_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"depthwise_regularizer":null,"pointwise_regularizer":null,"depthwise_constraint":null,"pointwise_constraint":null},"inbound_nodes":[[["add_Add2",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization5","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization5","trainable":true},"inbound_nodes":[[["separable_conv2d_SeparableConv2D5",0,0,{}]]]},{"name":"re_lu_ReLU5","class_name":"ReLU","config":{"max_value":null,"name":"re_lu_ReLU5","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization5",0,0,{}]]]},{"name":"separable_conv2d_SeparableConv2D6","class_name":"SeparableConv2D","config":{"filters":64,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"separable_conv2d_SeparableConv2D6","trainable":true,"depthwise_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"pointwise_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"depthwise_regularizer":null,"pointwise_regularizer":null,"depthwise_constraint":null,"pointwise_constraint":null},"inbound_nodes":[[["re_lu_ReLU5",0,0,{}]]]},{"name":"dropout_Dropout3","class_name":"Dropout","config":{"rate":0.3,"noise_shape":null,"seed":null,"name":"dropout_Dropout3","trainable":true},"inbound_nodes":[[["separable_conv2d_SeparableConv2D6",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization6","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization6","trainable":true},"inbound_nodes":[[["dropout_Dropout3",0,0,{}]]]},{"name":"conv2d_Conv2D3","class_name":"Conv2D","config":{"filters":64,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[1,1],"strides":[2,2],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D3","trainable":true},"inbound_nodes":[[["add_Add2",0,0,{}]]]},{"name":"re_lu_ReLU6","class_name":"ReLU","config":{"max_value":null,"name":"re_lu_ReLU6","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization6",0,0,{}]]]},{"name":"add_Add3","class_name":"Add","config":{"name":"add_Add3","trainable":true},"inbound_nodes":[[["conv2d_Conv2D3",0,0,{}],["re_lu_ReLU6",0,0,{}]]]},{"name":"separable_conv2d_SeparableConv2D7","class_name":"SeparableConv2D","config":{"filters":128,"kernel_size":[3,3],"strides":[2,2],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"separable_conv2d_SeparableConv2D7","trainable":true,"depthwise_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"pointwise_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"depthwise_regularizer":null,"pointwise_regularizer":null,"depthwise_constraint":null,"pointwise_constraint":null},"inbound_nodes":[[["add_Add3",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization7","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization7","trainable":true},"inbound_nodes":[[["separable_conv2d_SeparableConv2D7",0,0,{}]]]},{"name":"re_lu_ReLU7","class_name":"ReLU","config":{"max_value":null,"name":"re_lu_ReLU7","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization7",0,0,{}]]]},{"name":"separable_conv2d_SeparableConv2D8","class_name":"SeparableConv2D","config":{"filters":128,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"separable_conv2d_SeparableConv2D8","trainable":true,"depthwise_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"pointwise_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"depthwise_regularizer":null,"pointwise_regularizer":null,"depthwise_constraint":null,"pointwise_constraint":null},"inbound_nodes":[[["re_lu_ReLU7",0,0,{}]]]},{"name":"dropout_Dropout4","class_name":"Dropout","config":{"rate":0.3,"noise_shape":null,"seed":null,"name":"dropout_Dropout4","trainable":true},"inbound_nodes":[[["separable_conv2d_SeparableConv2D8",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization8","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization8","trainable":true},"inbound_nodes":[[["dropout_Dropout4",0,0,{}]]]},{"name":"conv2d_Conv2D4","class_name":"Conv2D","config":{"filters":128,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[1,1],"strides":[2,2],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D4","trainable":true},"inbound_nodes":[[["add_Add3",0,0,{}]]]},{"name":"re_lu_ReLU8","class_name":"ReLU","config":{"max_value":null,"name":"re_lu_ReLU8","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization8",0,0,{}]]]},{"name":"add_Add4","class_name":"Add","config":{"name":"add_Add4","trainable":true},"inbound_nodes":[[["conv2d_Conv2D4",0,0,{}],["re_lu_ReLU8",0,0,{}]]]},{"name":"average_pooling2d_AveragePooling2D1","class_name":"AveragePooling2D","config":{"pool_size":[8,8],"padding":"valid","strides":[1,1],"data_format":"channels_last","name":"average_pooling2d_AveragePooling2D1","trainable":true},"inbound_nodes":[[["add_Add4",0,0,{}]]]},{"name":"flatten_Flatten1","class_name":"Flatten","config":{"name":"flatten_Flatten1","trainable":true},"inbound_nodes":[[["average_pooling2d_AveragePooling2D1",0,0,{}]]]},{"name":"dropout_Dropout5","class_name":"Dropout","config":{"rate":0.5,"noise_shape":null,"seed":null,"name":"dropout_Dropout5","trainable":true},"inbound_nodes":[[["flatten_Flatten1",0,0,{}]]]},{"name":"dense_Dense1","class_name":"Dense","config":{"units":2,"activation":"softmax","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1","trainable":true},"inbound_nodes":[[["dropout_Dropout5",0,0,{}]]]}],"input_layers":[["input1",0,0]],"output_layers":[["dense_Dense1",0,0]]},"keras_version":"tfjs-layers 4.20.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"conv2d_Conv2D1/kernel","shape":[5,5,3,16],"dtype":"float32"},{"name":"conv2d_Conv2D1/bias","shape":[16],"dtype":"float32"},{"name":"separable_conv2d_SeparableConv2D1/depthwise_kernel","shape":[3,3,16,1],"dtype":"float32"},{"name":"separable_conv2d_SeparableConv2D1/pointwise_kernel","shape":[1,1,16,16],"dtype":"float32"},{"name":"separable_conv2d_SeparableConv2D1/bias","shape":[16],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization1/gamma","shape":[16],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization1/beta","shape":[16],"dtype":"float32"},{"name":"separable_conv2d_SeparableConv2D2/depthwise_kernel","shape":[3,3,16,1],"dtype":"float32"},{"name":"separable_conv2d_SeparableConv2D2/pointwise_kernel","shape":[1,1,16,16],"dtype":"float32"},{"name":"separable_conv2d_SeparableConv2D2/bias","shape":[16],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization2/gamma","shape":[16],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization2/beta","shape":[16],"dtype":"float32"},{"name":"separable_conv2d_SeparableConv2D3/depthwise_kernel","shape":[3,3,16,1],"dtype":"float32"},{"name":"separable_conv2d_SeparableConv2D3/pointwise_kernel","shape":[1,1,16,32],"dtype":"float32"},{"name":"separable_conv2d_SeparableConv2D3/bias","shape":[32],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization3/gamma","shape":[32],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization3/beta","shape":[32],"dtype":"float32"},{"name":"separable_conv2d_SeparableConv2D4/depthwise_kernel","shape":[3,3,32,1],"dtype":"float32"},{"name":"separable_conv2d_SeparableConv2D4/pointwise_kernel","shape":[1,1,32,32],"dtype":"float32"},{"name":"separable_conv2d_SeparableConv2D4/bias","shape":[32],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization4/gamma","shape":[32],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization4/beta","shape":[32],"dtype":"float32"},{"name":"conv2d_Conv2D2/kernel","shape":[1,1,16,32],"dtype":"float32"},{"name":"conv2d_Conv2D2/bias","shape":[32],"dtype":"float32"},{"name":"separable_conv2d_SeparableConv2D5/depthwise_kernel","shape":[3,3,32,1],"dtype":"float32"},{"name":"separable_conv2d_SeparableConv2D5/pointwise_kernel","shape":[1,1,32,64],"dtype":"float32"},{"name":"separable_conv2d_SeparableConv2D5/bias","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization5/gamma","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization5/beta","shape":[64],"dtype":"float32"},{"name":"separable_conv2d_SeparableConv2D6/depthwise_kernel","shape":[3,3,64,1],"dtype":"float32"},{"name":"separable_conv2d_SeparableConv2D6/pointwise_kernel","shape":[1,1,64,64],"dtype":"float32"},{"name":"separable_conv2d_SeparableConv2D6/bias","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization6/gamma","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization6/beta","shape":[64],"dtype":"float32"},{"name":"conv2d_Conv2D3/kernel","shape":[1,1,32,64],"dtype":"float32"},{"name":"conv2d_Conv2D3/bias","shape":[64],"dtype":"float32"},{"name":"separable_conv2d_SeparableConv2D7/depthwise_kernel","shape":[3,3,64,1],"dtype":"float32"},{"name":"separable_conv2d_SeparableConv2D7/pointwise_kernel","shape":[1,1,64,128],"dtype":"float32"},{"name":"separable_conv2d_SeparableConv2D7/bias","shape":[128],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization7/gamma","shape":[128],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization7/beta","shape":[128],"dtype":"float32"},{"name":"separable_conv2d_SeparableConv2D8/depthwise_kernel","shape":[3,3,128,1],"dtype":"float32"},{"name":"separable_conv2d_SeparableConv2D8/pointwise_kernel","shape":[1,1,128,128],"dtype":"float32"},{"name":"separable_conv2d_SeparableConv2D8/bias","shape":[128],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization8/gamma","shape":[128],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization8/beta","shape":[128],"dtype":"float32"},{"name":"conv2d_Conv2D4/kernel","shape":[1,1,64,128],"dtype":"float32"},{"name":"conv2d_Conv2D4/bias","shape":[128],"dtype":"float32"},{"name":"dense_Dense1/kernel","shape":[128,2],"dtype":"float32"},{"name":"dense_Dense1/bias","shape":[2],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization1/moving_mean","shape":[16],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization1/moving_variance","shape":[16],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization2/moving_mean","shape":[16],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization2/moving_variance","shape":[16],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization3/moving_mean","shape":[32],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization3/moving_variance","shape":[32],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization4/moving_mean","shape":[32],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization4/moving_variance","shape":[32],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization5/moving_mean","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization5/moving_variance","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization6/moving_mean","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization6/moving_variance","shape":[64],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization7/moving_mean","shape":[128],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization7/moving_variance","shape":[128],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization8/moving_mean","shape":[128],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization8/moving_variance","shape":[128],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.20.0","convertedBy":null}